/*
    বেসিক কনসেপ্ট চেকলিস্ট/সেলফ এসেসমেন্ট: 

    একটা কাগজ কলম নিয়ে বসো। নিচের প্রশ্নগুলোর উত্তর যদি হাঁ হয় তাহলে ১ লিখবে আর যদি না হয় তাহলে শূন্য লিখবে। এবং জিনিসগুলো ভিজুয়াল ষ্টুডিও কোড এ প্রাকটিস করবে। কোন একটা জিনিস নিজে নিজে করতে পারলে অবশ্যই ভালো। আর কোন একটা জিনিস নিজে নিজে না পারলে, আমাদের ভিডিও না দেখে যদি গুগলে সার্চ দিয়ে বের করে হলেও যদি করে ফেলতে পারো তাহলেও চলবে। 
*/
//  ১. তোমাকে যদি বলি একটা স্ট্রিং টাইপের ভেরিয়েবল লিখো। একটা বুলিয়ান টাইপের ভেরিয়েবল লিখো বা একটা নাম্বার টাইপের ভেরিয়েবল লিখো। সেটা কি তুমি লিখতে পারবে? যদি পারো তাহলে ভিজুয়াল ষ্টুডিও কোড খুলে লিখে ফেলো। 
var name = 'sazzad';
var isHappy = true;
var age = 39;

// ২. তুমি কি জানো কখন let দিয়ে ভেরিয়েবল লিখতে হয়ে আর কখন const দিয়ে ভেরিয়েবল লিখতে হয়। যদি লিখতে পারো তাহলে লিখে ফেলো। এবং যেই যেটা দিয়ে ভেরিয়েবল লিখলে আবার সেটা চেইঞ্জ করা যায়। তাহলে যেটা দিয়ে ভেরিয়েবল ডিক্লেয়ার করলে চেইঞ্জ করা যায়। সেটার মান চেইঞ্জ করে নাও । অর্থাৎ জাস্ট দুইটা ভেরিয়েবল ডিক্লেয়ার করবে let এবং const দিয়ে। তারপর যেকোন একটার ভ্যালু চেইঞ্জ করবে। এই let এবং const মাথা গরম করে দিলে টেনশন নিয়ে না। সামনের মাইলস্টোন এর পরের মাইলস্টোন এ এইটা নিয়ে আরো ডিসকাস করা হবে। 

let age2 = 12;
age2 = 13
console.log(age2);

// const age3 = 20;
// age3 = 30;
// console.log(age3);

// ৩. দুইটা ভেরিয়েবল এর মধ্যে যোগ, বিয়োগ, গুণ, ভাগ কিভাবে করতে হয় সেটা কি জানো। অর্থাৎ তুমি কি +, -, *, /, %এইগুলার ব্যবহার জানো। তাহলে নাম্বার টাইপের দুইটা ভেরিয়েবল লিখো তারপর তাদের যোগ করে সেটার মান আরেকটা ভেরিয়েবল এ রাখো। একইভাবে ওই দুইটা ভেরিয়েবল এর মধ্যে বিয়োগ, গুন, ভাগ এবং ভাগশেষ বের করো। 
var num1 = 10;
var num2 = 20;
var total = num1 + num2;
var total1 = num1 - num2;
var total2 = num1 * num2;
var total3 = num1 / num2;
var total4 = num1 % num2;
console.log(total4);

// ৪. তুমি কি দুইটা ভেরিয়েবল এরমধ্যে তুলনা করতে পারো। কম্পারিজন করতে পারো। যে দুইটা ভেরিয়েবল এর মধ্যে প্রথমটা সেকেন্ডটা এর চাইতে ছোট, বড়, অসমান, সমান , ছোট বা সমান, বড় বা সমান। এইগুলা চেক করতে পারো। অর্থাৎ <, >, ==, !=, <=, >= চিহ্নগুলা ব্যবহার করতে পারো। তাহলে দুইটা সংখ্যা টাইপের ভেরিয়েবল ডিক্লেয়ার করে তাদেরকে এই ছয়ভাবে তুলনা করে কোড লিখে ফেলো। 
var a = 10;
var b = 20;
var c = a < b;
var d = a > b;
var e = a == b;
var f = a != b;
var g = a <= b;
var h = a >= b;
console.log(h)

// ৫. তোমার যদি দুইটা শর্ত পূরণ করতে বলে। এবং দুইটা শর্তের মধ্যে দুইটাই পূরণ করতে হবে। তাহলে তুমি কি সেটা চেক করতে পারবে? একইভাবে যদি বলে তুমি দুইটা শর্তের যেকোন একটা পূরণ করতে পারবে। অর্থাৎ তুমি && এবং || এর ব্যবহার করতে পারো কিনা। যদি পারো তাহলে নিজে নিজে এই রকমের কোড লিখে ফেলো।

// ৬. তুমি কি একটা শর্ত পালন করলে একটা কিছু করবে। শর্ত পূরণ না করলে অন্য কিছু একটা করবে এমন কোড লিখতে পারবে। অর্থাৎ তুমি কি if-else এর কোড লিখতে পারবে। পারলে একটা কোড লিখে ফেলো 

var andOper = 3;
if (andOper > 0 && andOper <= 32) {
    console.log('failed')
} else {
    console.log('passs')
}

var orOpe = 'sobuz'
if (orOpe === 'sazzad' || orOpe === 'sobuz') {
    console.log('correct')
} else {
    console.log('false')
}

// ৭. তোমাকে যদি বলে একটা while লুপ দিয়ে ৭ থেকে ১৯ পর্যন্ত যতগুলা বিজোড় সংখ্যা আছে সেগুলা দেখাতে। তুমি কি সেটা দেখাতে পারবে? পারলে সেই কোড লিখে ফেলো। 

function oddNummbers(number) {
    let i = 0;
    while (i < numbe)
}
let i = 7;
while (i > 19) {

}